#define _CRT_SECURE_NO_WARNINGS 1

#include "basic.h"



/*///////////////////////////////////////////////


*************************************************
*				机房机位预定系统				*
*												*
*					主菜单						*
*												*
*				1.查询							*
*				2.预定							*
*				3.取消预定						*
*				0.退出							*
*												*
*												*
*												*
*												*
*												*
*************************************************


				15行
/////////////////////////////////////////////////
*/



//初始信息
void Start()
{
	printf("\n	      欢迎使用我们的系统！\n\n");
	printf("*************************************************\n");
	printf("*		机房机位预定系统		*\n");
	printf("*						*\n");
	printf("* 本系统共有20台机器，且有以下6个时间段可供预约 *\n");
	printf("*						*\n");
	printf("* 8:00-10:00	10:00-12:00	12:00-14:00	*\n");
	printf("* 14:00-16:00	16:00-18:00	18:00-20:00	*\n");
	printf("*						*\n");
	printf("*************************************************\n\n");
	printf("---------------------友情提示--------------------\n");
	printf("-----选择时间段时请按序号1到序号6的顺序选择------\n");
	printf("--例：8:00-10:00的序号是1，18:00-20:00的序号是6--\n");
	printf("-----------机器号则按从1-20的顺序选择------------\n\n\n");
}



//打印“机房预定系统”菜单
void Menu()
{
	printf("\n\n\n\n");
	printf("*************************************************\n");
	printf("*		机房机位预定系统		*\n");
	printf("*						*\n");
	printf("*		    主菜单			*\n");
	printf("*						*\n");
	printf("*		1.查询				*\n");
	printf("*		2.预定				*\n");
	printf("*		3.取消预定			*\n");
	printf("*		0.退出				*\n");
	printf("*						*\n");
	printf("*						*\n");
	printf("*************************************************\n");
	printf("\n\n");
}












/*




//显示预定信息
void show_info(int time, int seat) {
	printf("*************************************************\n");
	printf("*		机房机位预定系统		*\n");
	printf("*						*\n");
	printf("*		    预定信息			*\n");
	printf("*						*\n");
	printf("*		时间段：%d			*\n", time);
	printf("*		机器号：%d			*\n", seat);
	printf("*						*\n");
	printf("*************************************************\n");
	printf("请按任意键返回主菜单\n");
	getchar(); //等待用户输入
	Menu(); //返回主菜单
}


*/






































/*

please chooose the function you want to realize
						主菜单
				1.查询所选时间机器空闲状态
				2.预定所选时间的特定机器
				3.退出所选时间段的机器的预定状态预定

|-------------------------------------------------------------------------------------------------------|
|								Computer Room Reservation System										|
|									机房机位预定系统													|
|																										|
|																										|
|										主菜单															|
|								1.查询所选时间机器空闲状态												|
|								2.预定所选时间的特定机器												|
|								3.退出所选时间段的机器的预定状态预定									|
|								0.退出																	|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|																										|
|-------------------------------------------------------------------------------------------------------|



*/